#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=58be3b3d598e172fbb02fde253a64c111c190d87]
local_file.tfkey: Refreshing state... [id=af7c77e187db497ad751edc4ac68273899fc0385]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0a2809d5d32194b78]
aws_vpc.main: Refreshing state... [id=vpc-021748a35c3df592c]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0c441a18f3d353a62]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-008901d16727d7615]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-06e97f149055e929d]
aws_security_group.allow_ssh: Refreshing state... [id=sg-09572ea7b3f3a0575]
aws_security_group.elb: Refreshing state... [id=sg-00ec8cf0533447ab3]
aws_security_group.allow_http: Refreshing state... [id=sg-0be228b2705267acc]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0cffb9823f4eb5374]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0112460371457c4dd]
aws_route_table.public_route_table: Refreshing state... [id=rtb-047656a5fc1605ece]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0029ccf3f95b44ad1]
aws_instance.bastion-host: Refreshing state... [id=i-06072c7e2892ba0f2]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-08189656c107fd68b]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0c4d94894d03685e6]
aws_route_table.private_route_table: Refreshing state... [id=rtb-08b125e98884b29bd]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230125162710475100000001]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-08ec7b00e22a94dde]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-039caf1af038ef838]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230125163139095000000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.auto_scaling_group has been deleted
  - resource "aws_autoscaling_group" "auto_scaling_group" {
      - id                        = "Auto Scaling Group" -> null
        name                      = "Auto Scaling Group"
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "Auto Scaling Group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-06e97f149055e929d",
          + "subnet-0cffb9823f4eb5374",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "Application Server"
        }
    }

  # aws_launch_configuration.ec2_config must be replaced
-/+ resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:874828247585:launchConfiguration:6cc110e6-580d-4f9f-932e-a5ed789bc92f:launchConfigurationName/terraform-20230125162710475100000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230125162710475100000001" -> (known after apply)
      ~ name                             = "terraform-20230125162710475100000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      ~ user_data                        = "aa2cf4da89380974fdbb1b3c7ffbfa644bb8e869" -> "c0474efef832d7529152836d553c672a37995254" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*